function ChouQian(id) {
    let qian='';
    let jie='';
    if (id == 1){
        qian = `第一大吉
七宝浮图塔
高峯顶上安
众人皆仰望
莫作等闲看`
        jie = `
愿望：会充分地实现吧。
疾病：会治愈吧。
盼望的人：会出现吧。
遗失物：变得迟迟地才找到吧。
盖新居、搬家、嫁娶、旅行、交往等：全部很好吧。
万事行为谨慎。粗心大意行事的话，就会发生意想之外的灾害吧。`;}
    else if (id == 2){
        qian = `第二小吉
月被浮云翳
立事自昏迷
幸乞阴公佑
何虑不开眉`
        jie = `
愿望：因为持续不断地努力，必定会实现。
疾病：虽然拖长，但是之后可以康复吧。
盼望的人：迟迟地才出现吧。
遗失物：不能找出来吧。
交往：要节制吧。
盖新居、搬家：都不坏吧。
结亲缘、旅行：顺利进行吧。`;}
    else if (id == 3){
        qian = `第三凶
愁恼损忠良
青宵一炷香
虽然防小过
闲虑觉时长`
        jie = `
愿望：难实现吧。
疾病：虽然拖长，但是会治好吧。
遗失物：难以找到吧。
盼望的人：要花很久的时间吧。
旅行：因为很坏，放弃吧。
盖新居搬家：勉勉强强地算好吧。
结婚交往：要节制吧。`;}
    else if (id == 4){
        qian = `第四吉
累有兴云志
君恩禄未封
若逢侯手印
好事始总总`
        jie = `
愿望：能实现吧。如果这样的话，终生幸福吧。
疾病：变得迟迟地才会治好吧。
遗失物：迟迟地才找到吧。
盼望的人：会出现吧。
旅行：途中要忍耐各式各样的困难吧。
盖新居、搬家、结亲缘、交往：万事都好吧。`;}
    else if (id == 5){
        qian = `第五凶
家道未能昌
危危保祸殃
暗云侵月桂
佳人一炷香`
        jie = `
愿望：难以实现吧。
疾病：难治好吧。
遗失物：难找到吧。
盼望的人：不会出现吧。
盖新居、搬家：先放弃，暂时观察情况再说吧。
结亲缘、旅行、交往：因为万事凶恶，请诸行为慎重行事。`;}
    else if (id == 6){
        qian = `第六末吉
宅墓鬼凶多
人事有爻讹
伤财防损失
祈福始中和`
        jie = `
愿望：难以实现吧。
疾病：康复很花时间吧。
遗失物：难找到吧。
盼望的人：迟迟地才出现吧。
盖新居、搬家：好吧。
旅行：好吧。
结亲缘、交往：坏吧。`;}
    else if (id == 7){
        qian = `第七凶
登舟待便风
月色暗蒙眬
遇碾香轮去
高山千万重`
        jie = `
愿望：难以实现吧。
疾病：难以治愈吧。
遗失物：难以找到吧。
盼望的人：不会出现吧。
盖新居、搬家：换时间吧。
结亲缘、喜庆祝贺、旅行、交往：不好吧。`;}
    else if (id == 8){
        qian = `第八大吉
勿头中见尾
文华须得理
禾刀自偶然
当遇非常喜`
        jie = `
愿望：会实现吧。
疾病：会治好。请注意养生吧。
遗失物：可以找到吧。
盼望的人：会出现吧。
盖新居、搬家、交往：是好事吧。
旅行：途中请不要粗心大意吧。
结亲缘：全都是好的吧。`;}
    else if (id == 9){
        qian = `第九大吉
有名须得遇
三望一朝迁
贵人来指处
华菓应时鲜`
        jie = `
愿望：会实现吧。
疾病：会治好吧。
遗失物：会找到吧。
盼望的人：会出现吧。
盖新居、搬家：好吧。
结亲缘、交往：全都好吧。
旅行：没问题吧。`;}
    else if (id == 10){
        qian = `第十大吉
旧用多成破
新更始见财
改求云外望
枯木遇春开`
        jie = `
愿望：会实现吧。
疾病：会治好吧。
遗失物：立刻会找到吧。
盼望的人：会出现吧。
盖新居、搬家：会变为好结果吧。
结亲缘、旅行、交往：全部变为好结果吧。`;}
    else if (id == 11){
        qian = `第十一大吉
有禄兴家业
文华达帝都
云中乘好箭
兼得贵人扶`
        jie = `
愿望：会充分地实现吧。
疾病：会治好吧。
遗失物：会找到吧。
盼望的人：会出现吧。
盖新居、搬家：好吧。
旅行：没问题吧。
结婚、交往：全部都能得到好结果吧。`;}
    else if (id == 12){
        qian = `第十二大吉
杨柳遇春时
残花发旧枝
重重霜雪里
黄金色更辉`
        jie = `
愿望：会实现吧。
疾病：会变好吧。
遗失物：会回来吧。
盼望的人：晚出现吧。
盖新居、搬家：会成为好结果吧。
旅行：没有阻碍吧。
结婚、交往：全都适当吧。`;}
    else if (id == 13){
        qian = `第十三大吉
手把大阳辉
东君发旧枝
稼苗方欲秀
犹更上云梯`
        jie = `
愿望：会实现吧。
疾病：会治好吧。
遗失物：立刻找就能找到吧。
盼望的人：会出现吧。
盖新居、搬家：好吧。
旅行：在春天和夏天好吧。
结婚、交往：全部都好吧。`;}
    else if (id == 14){
        qian = `第十四末吉
玉石未分时
忧心转更悲
前途通大道
花发应残枝`
        jie = `
愿望：很花时间但会实现吧。
疾病：会拖长吧，但是不会影响性命吧。
遗失物：难出现吧。
盼望的人：似乎会变得迟吧。
盖新居、搬家：不太好吧。
结婚：现在要节制，如果往后的话好吧。
旅行、交往：避开吧。`;}
    else if (id == 15){
        qian = `第十五凶
年乖数亦孤
久病未能苏
岸危舟未发
龙卧失明珠`
        jie = `
愿望：难以实现吧。
疾病：危险吧。
遗失物：难找回吧。
盼望的人：不会出现吧。
盖新居、搬家：都不好吧。
旅行、结亲缘：坏吧。`;}
    else if (id == 16){
        qian = `第十六吉
破改重成望
前途喜亦宁
贵人相助处
禄马照前程`
        jie = `
愿望：能被实现吧。
疾病：会康复吧。
遗失物：会出现吧。
盼望的人：会来吧。
盖新居、搬家：会有好结果吧。
旅行：好吧。结亲缘、交往：全部会变成好结果吧。`;}
    else if (id == 17){
        qian = `第十七凶
怪异防忧恼
人宅见分离
惜华还值雨
杯酒惹闲非`
        jie = `
愿望：难实现吧。
疾病：康复需要长时间吧。
遗失物：不会出现吧。
盼望的人：不会出现吧。
盖新居、搬家：先放弃，暂时观察情况再说吧。
旅行：似乎引起坏的结果吧。
婚事、交往：全部不好吧。`;}
    else if (id == 18){
        qian = `第十八吉
离暗出明时
麻衣变绿衣
旧忧终是退
遇禄应交辉`
        jie = `
愿望：会实践吧。
疾病：会治好吧。
遗失物：会出现吧。
盼望的人：会出现吧。
盖新居、搬家：好吧。
旅行：好吧。
结亲缘、交往：全部变为好结果吧。`;}
    else if (id == 19){
        qian = `第十九末小吉
家道生荆棘
儿孙防虎威
香前祈福厚
方得免分离`
        jie = `
愿望：能实现一半吧。
疾病：虽然长期得病，但是不会危及性命吧。
遗失物：大概找回不来了吧。
盼望的人：变成迟迟地出现吧。
盖新居、搬家：不好也不坏吧。
旅行：节制比较好吧。
结婚：不会到达好的结果吧。
交往：节制吧。`;}
    else if (id == 20){
        qian = `第二十吉
月出渐分明
家财每每兴
何言先有滞
更变立功名`
        jie = `
愿望：能被实现吧。
疾病：会治好吧。
遗失物：会出现吧。
盼望的人：会来吧。
盖新居、搬家：好吧。
结婚、交往：全部都得到好结果吧。
旅行：好吧。`;}
    else if (id == 21){
        qian = `第二十一吉
洗出经年否
光华得再清
所求终吉利
重日照前程`
        jie = `
愿望：能被实现吧。
疾病：虽然会恢复但是切忌粗心大意。
遗失物：会出现吧。
盼望的人：会出现吧。
盖新居、搬家：好吧。
结婚：会得到好结果吧。
旅行、交往：全部好吧。`;}
    else if (id == 22){
        qian = `第二十二吉
渐渐浓云散
看看月再明
逢春华菓秀
雨过竹重青`
        jie = `
愿望：虽然能被实现，但是变得比较晚吧。
疾病：因为会治好，耐心等待康复吧。
遗失物：虽然会出现但很迟吧。
盼望的人：会出现吧。
盖新居、搬家：好吧。
结婚、旅行、交往：全都好吧。`;}
    else if (id == 23){
        qian = `第二十三吉
红云随步起
一箭中青霄
鹿行千里远
争知去路遥
【争知】就是现代`
        jie = `用语的『怎知』之意。

愿望：虽然会实现，但是要考虑能力吧。
疾病：难以康复吧。
遗失物：难以找到吧。
盼望的人：不能出现吧。
盖新居、搬家：好吧。
结婚、交往：好吧。
旅行：没问题吧。`;}
    else if (id == 24){
        qian = `第二十四凶
三女莫相逢
盟言说未通
门里心肝挂
缟素子重重
（三女的意思是`
        jie = `奸字）

愿望：不会实现吧。
疾病：虽然拖很长，但会治好吧。
遗失物：变成到后来才找到吧。
盼望的人：不能出现吧。
盖新居、搬家：不好吧。
旅行：不好吧。
结婚、交往：变成不好的结果吧。`;}
    else if (id == 25){
        qian = `第二十五吉
枯木逢春生
前途必利亨
亦得佳人箭
乘车禄自行`
        jie = `
愿望：会实现吧。
疾病：会治好吧。
遗失物：会出现吧。
盼望的人：迟迟才来吧。
盖新居、搬家：似乎没问题。
结婚、旅行、交往：全部都变成好结果吧。`;}
    else if (id == 26){
        qian = `第二十六吉
将军有异声
进兵万里程
争知临敌处
道胜却虚名
【争知】就是现代`
        jie = `用语的『怎知』之意。

愿望：会实现吧。
疾病：会治好吧。
遗失物：会出现吧。
盼望的人：会出现吧。
盖新居、搬家：好吧。
旅行：好吧。
结婚、交往：会变成好结果吧。`;}
    else if (id == 27){
        qian = `第二十七吉
望禄应重山
花红喜悦颜
举头看皎月
渐出黑云间`
        jie = `
愿望：会实现吧。
疾病：会治好吧，但切忌粗心大意。
遗失物：会出现吧。
盼望的人：会出现吧。
盖新居、搬家：好吧。
旅行：非常好吧。
结婚、交往：全部都变成好结果吧。`;}
    else if (id == 28){
        qian = `第二十八凶
意速无船渡
波深必误身
切须回旧路
方可免灾迍
迍：zhun(1,处`
            jie = `境艰险，前进困难

愿望：难以实现吧。
疾病：如果长期养生的话会治好吧。
遗失物：难出现吧。
盼望的人：变得迟迟地才出现吧。
盖新居、搬家：坏吧。
结婚、交往：坏吧。`;}
    else if (id == 29){
        qian = `第二十九吉
忧轗渐消融
求名得再通
宝财临禄位
当遇主人公
轗：kan(3，形`
        jie = `容车行颠簸不顺的样子，比喻人不得志。

愿望：能被实现吧。
疾病：会治好吧。
遗失物：会出现吧。
盼望的人：会出现吧。
盖新居、搬家：好吧。
结婚、交往：全都好吧。`;}
    else if (id == 30){
        qian = `第三十半吉
仙鹤立高枝
防他暗箭亏
井畔刚刀利
户内更防危`
        jie = `
愿望：难实现吧。
疾病：危险吧。
遗失物：难出现吧。
盼望的人：不会出现吧。
盖新居、搬家：如果能祈求神佛的保佑，会变成勉强可以的结果吧。
旅行：坏吧。
结婚、交往：节制吧。`;}
    else if (id == 31){
        qian = `第三十一末吉
鲲鲸未变时
且守碧潭溪
风云兴巨浪
一息过天涯`
        jie = `
愿望：虽能被实现，但要考虑时机吧。
疾病：拖很久吧。
遗失物：变得迟迟地才出现吧。
盼望的人：变得迟迟地才出现吧。
盖新居、搬家：没阻碍吧。
旅行：好吧。
结婚、交往：好吧。`;}
    else if (id == 32){
        qian = `第三十二吉
似玉藏深石
休将故眼看
一朝良匠别
方见宝光寒`
        jie = `
愿望：会实现吧。
疾病：虽然会拖长，但是不会失去生命。
遗失物：会出现吧。
盼望的人：变得迟迟地才出现吧。
盖新居、搬家：好吧。
结婚、交往：全部和好结果有关吧。`;}
    else if (id == 33){
        qian = `第三十三吉
枯木逢春艳
芳菲再发林
云间方见月
前遇贵人钦`
        jie = `
愿望：能被实现吧。
疾病：会治好吧。
遗失物：会出现吧。
盼望的人：会出现吧。
盖新居、搬家：没有阻碍吧。
旅行：好吧。
结婚、交往：全都好吧。`;}
    else if (id == 34){
        qian = `第三十四吉
腊木春将至
芳菲喜再新
鲲鲸兴巨浪
举钩禄为真`
        jie = `
愿望：能被实现吧。
疾病：会治好吧。
遗失物：迟迟才出现吧。
盼望的人：迟吧。
盖新居、搬家：好吧。
旅行：好吧。
结婚、交往：全都和好结果相连吧。`;}
    else if (id == 35){
        qian = `第三十五吉
射鹿须乘箭
故僧引路归
遇道同仙籍
光华映晚晖`
        jie = `
愿望：能被实现吧。
疾病：会治好吧。
遗失物：会出现吧。
盼望的人：变迟才出现吧。
盖新居、搬家：没有障碍吧。
旅行：好吧。
结婚、交往：好吧。`;}
    else if (id == 36){
        qian = `第三十六末吉
先损后有益
如月之剥蚀
玉兔待重生
光华当满室`
        jie = `
愿望：稍后会实现吧。
疾病：虽然拖长，但可以治愈吧。
遗失物：难出现吧。
盼望的人：迟迟地才出现吧。
盖新居、搬家：应该先放弃，暂时多观察情况再说吧。
旅行：途中，似乎会有不好的事吧。
结亲缘、喜庆、交往：不好吧。`;}
    else if (id == 37){
        qian = `第三十七半吉
阴叆未能通
求名亦未逢
幸然须有变
一箭中双鸿`
        jie = `
愿望：难以实现吧。
疾病：变成迟迟地才好转吧。
遗失物：变成迟迟地才出现吧。
盼望的人：变成迟迟地才出现吧。
盖新居、搬家：好吧。
旅行：好吧。
结婚、交往：往后一点，变成好吧。`;}
    else if (id == 38){
        qian = `第三十八半吉
月照天书静
云生雾彩霞
久想离庭客
无事惹咨嗟`
        jie = `
愿望：难实现吧。
疾病：会拖长吧。
遗失物：难出现吧。
盼望的人：不会出现吧。
盖新居、搬家：不好也不坏吧。
旅行：先放弃，暂时观察情况再说吧。
结婚、交往：先放弃，暂时观察情况吧。`;}
    else if (id == 39){
        qian = `第三十九凶
望用方心腹
家乡被火灾
忧危三五度
由损断头财`
        jie = `
愿望：难以实现吧。
疾病：又坏又危险吧。
遗失物：难出现吧。
盼望的人：不会出现吧。
盖新居、搬家：避开比较好吧。
旅行：不好吧。
结婚、交往：招致坏结果吧。`;}
    else if (id == 40){
        qian = `第四十末小吉
中正方成道
奸邪恐惹愆　
壶中盛妙药
非久去烦煎
愆：qian(1，过`
            jie = `失、罪过之意

愿望：难以立刻地实现吧。
疾病：虽然拖长但会治好吧。
遗失物：会出现吧。
盼望的人：变成迟迟才地出现吧。
盖新居、搬家：好吧。
旅行：好吧。
结婚、交往：不好也不坏吧。`;}
    else if (id == 41){
        qian = `第四十一末吉
有物不周旋
须防损半边
家乡烟火里
祈福始安然`
        jie = `
愿望：难以实现吧。
疾病：会拖长吧。
遗失物：难出现吧。
盼望的人：变成迟迟地才出现吧。
盖新居、搬家：不好吧。
旅行：途中似乎有不好的事。
结婚、交往：会产生不好的结果吧。`;}
    else if (id == 42){
        qian = `第四十二吉
桂华春将到
云天好进程
贵人相遇处
暗月再分明`
        jie = `
愿望：会实现吧。
疾病：会治愈吧。
遗失物：会出现吧。
盖新居、搬家：好吧。
盼望的人：变成迟迟地才出现吧。
旅行：好吧。
结婚、交往：全都会变成好结果吧。`;}
    else if (id == 43){
        qian = `第四十三吉
月桂将相满
追鹿映山溪
贵人乘远箭
好事始相宜`
        jie = `
愿望：会实现吧。
疾病：虽然拖长但是会治好吧。
遗失物：难出现吧。
盼望的人：变成迟迟地才出现吧。
盖新居、搬家：好吧。
旅行：好吧。
结婚、交往：变成好结果吧。`;}
    else if (id == 44){
        qian = `第四十四吉
盘中黑白子
一着要先机
天龙降甘泽
洗出旧根基`
        jie = `
愿望：会实现吧。
疾病：会治愈吧。
遗失物：会出现吧。
盼望的人：变成迟迟地才出现吧。
盖新居、搬家：没问题吧。
旅行：好吧。
结婚、交往：全都好吧。`;}
    else if (id == 45){
        qian = `第四十五吉
有意兴高显
禄马引前程
得遇云中箭
芝兰满路生`
        jie = `
愿望：会实现吧。
疾病：会治好吧。
遗失物：迟迟地才出现吧。
盼望的人：变迟迟地才出现吧。
盖新居、搬家：好吧。
旅行：好吧。
结婚、交往：全都好结果相连吧。`;}
    else if (id == 46){
        qian = `第四十六凶
雷发震天昏
佳人独掩门
交加文书上
无事也遭迍
迍：zhun(1处境`
            jie = `艰险，前进困难

愿望：难以实现吧。
疾病：会治好吧。
遗失物：难出现吧。
盼望的人：不会出现吧。
盖新居、搬家：现在放弃吧。
旅行：在途中有不好的事吧。
结婚、交往：会产生不好的结果吧。`;}
    else if (id == 47){
        qian = `第四十七吉
更望身前立
何期在晚成
若遇重山去
财禄自相迎`
        jie = `
愿望：会实现吧。
疾病：变成往后才会治好吧。
遗失物：会出现吧。
盼望的人：变得迟迟才出现吧。
盖新居、搬家：好吧。
旅行：在将来似乎有好事吧。
结婚、交往：全部都可得到好结果吧。`;}
    else if (id == 48){
        qian = `第四十八小吉
见禄隔前溪
劳心休更迷
一朝逢好渡
鸾凤入云飞`
        jie = `
愿望：如果一直抱持着正直的心的话，到后来能被实现吧。
疾病：虽然拖长，但将来会治好吧。
遗失物：会出现吧。
盼望的人：变成迟迟才来吧。
盖新居、搬家：虽然开始不好，但是到后来会变好吧。
结婚、交往、旅行：马马虎虎吧。`;}
    else if (id == 49){
        qian = `第四十九吉
正好中秋月
蟾蜍皎洁间
暗云知何处
故故两相攀`
        jie = `
愿望：会实现吧。
疾病：严重吧。
遗失物：难出现吧。
盼望的人：变成迟迟才出现吧。
盖新居、搬家：马马虎虎吧。
旅行：好吧。
结婚、交往：马马虎虎吧。`;}
    else if (id == 50){
        qian = `第五十吉
有达宜更变
重山利政逢
前途相偶合
财禄保亨通
（重山即指两山`
        jie = `相迭的出字）

愿望：会实现吧。
疾病：会治好吧。
遗失物：会出现吧。
盼望的人：变迟吧。
盖新居、搬家：好吧。
旅行：成为好的旅行吧。
结婚、交往：成为好的结果吧。`;}
    else if (id == 51){
        qian = `第五十一吉
修进甚功辛
劳生未得时
腾身游碧汉
方得遇高枝`
        jie = `
愿望：会实现吧。
疾病：变成往后才治好吧。
遗失物：难出现吧。
盼望的人：变晚吧。
盖新居、搬家：好吧。
旅行：好事吧。
结婚、交往：会得到好结果吧。`;}
    else if (id == 52){
        qian = `第五十二凶
有僭须惹讼
兼有事交加
门里防人危
灾临莫叹嗟`
        jie = `
愿望：难实现吧。
疾病：会拖长吧。
遗失物：难出现吧。
盼望的人：不会出现吧。
盖新居、搬家：马马虎虎还算有点好吧。
旅行：因为不好，避开吧。
结婚、交往：不好也不坏吧。`;}
    else if (id == 53){
        qian = `第五十三吉
久困渐能安
云书降印权
残花终结实
时亨禄自迁`
        jie = `
愿望：能被实现吧。
疾病：会治好吧。
遗失物：变得迟迟才找到吧。
盼望的人：迟迟地才出现吧。
盖新居、搬家：好吧。
旅行：变成好的旅行吧。
结婚、交往：全都朝向好的方向发展吧。`;}
    else if (id == 54){
        qian = `第五十四凶
身同意不同
月蚀暗长空
轮虽常在手
鱼水未相逢`
        jie = `
愿望：难实现吧。
疾病：危险吧。
遗失物：难出现吧。
盼望的人：不会出现吧。
盖新居、搬家：暂时放弃，再观察看看吧。
结婚、交往：变成坏结果吧。`;}
    else if (id == 55){
        qian = `第五十五吉
云散月重明
天书得志诚
虽然多阻滞
花发再重荣`
        jie = `
愿望：会实现吧。
疾病：会治好吧。
遗失物：会找到吧。
盼望的人：变迟吧。
盖新居、搬家：好吧。
旅行：好吧。
结婚、交往：全都好吧。`;}
    else if (id == 56){
        qian = `第五十六末小吉
生涯喜又忧
未老先白头
劳心千百度
方遇贵人留`
        jie = `
愿望：难实现吧。
疾病：变成迟迟才治好吧。
遗失物：会出现吧。
盼望的人：迟迟才出现吧。
盖新居、搬家：半吉吧。
旅行：如果有一起同行的人的话好（安全）吧。
结婚、交往：马马虎虎还可以吧。`;}
    else if (id == 57){
        qian = `第五十七吉
欲渡长江阔
波深未自俦
前津逢浪静
重整钩鳌钩`
        jie = `
愿望：会实现吧。
疾病：虽然会治好，但会拖长吧。
遗失物：会出现吧。
盼望的人：变迟迟才出现吧。
盖新居、搬家：好吧。
旅行：坏吧。
结婚、交往：马马虎虎还可以吧。`;}
    else if (id == 58){
        qian = `第五十八凶
有径江海隔
车行峻岭危
亦防多进退
犹恐小人亏`
        jie = `
愿望：难实现吧。
疾病：不能安心吧。
遗失物：难出现吧。
盼望的人：不会出现吧。
盖新居、搬家：中止吧。
结婚、交往、旅行：坏吧。`;}
    else if (id == 59){
        qian = `第五十九凶
去住心无定
行藏亦未宁
一轮清皎洁
却被黑云乘`
        jie = `
愿望：难实现吧。
疾病：危险吧。
遗失物：难出现吧。
盼望的人：不会出现吧。
盖新居、搬家：坏吧。
旅行：似乎会发生坏事吧。
结婚、交往：得到坏结果吧。`;}
    else if (id == 60){
        qian = `第六十小吉
高危安可涉
平坦是延年
守道当逢泰
风云不偶然`
        jie = `
愿望：如果正心而行的话会实现吧。
疾病：会拖长吧。
遗失物：难出现吧。
盼望的人：不会出现吧。
盖新居、搬家：不好吧。
旅行：马马虎虎地算好吧。
结婚、交往：马马虎虎地算好吧。`;}
    else if (id == 61){
        qian = `第六十一半吉
旧愆何日解
户内保婵娟
要逢十一口
遇鼠过牛边`
        jie = `
愿望：难实现吧。
疾病：会拖长吧。
遗失物：难找到吧。
盼望的人：变迟吧。
盖新居、搬家：坏吧。
旅行：坏吧。
结婚、交往：不好吧。`;}
    else if (id == 62){
        qian = `第六十二大吉
灾轗时时退
名显四方扬
改故重乘禄
昴高福自昌
轗：kan(3，形`
            jie = `容车行颠簸不顺的样子，比喻人不得志。

愿望：会实现吧。
疾病：会治好吧。
遗失物：会出现吧。
盼望的人：会出现吧。
盖新居、搬家：没问题吧。
旅行：好吧。
结婚、交往：全都好吧。`;}
    else if (id == 63){
        qian = `第六十三凶
何故生荆棘
佳人意渐疏
久困重轮下
黄金未出渠`
        jie = `
愿望：难实现吧。
疾病：难治愈吧。
遗失物：难找到吧。
盼望的人：不会出现吧。
盖新居、搬家：坏吧。
旅行：似乎会发生坏事吧。
结婚、交往：会产生坏结果吧。`;}
    else if (id == 64){
        qian = `第六十四凶
安居且虑危
情深主别离
风飘波浪急
鸳鸯各自飞`
        jie = `
愿望：难实现吧。
疾病：危险吧。
遗失物：不会出现吧。
盼望的人：不会出现吧。
盖新居、搬家：还可以吧。
旅行：还可以吧。
结婚、交往：不好吧。`;}
    else if (id == 65){
        qian = `第六十五末吉
苦病兼防辱
乘危亦未稣
若见一阳后
方可作良图`
        jie = `
愿望：以后会实现吧。
疾病：虽然拖长但会治好吧。
遗失物：不会出现吧。
盼望的人：变得迟迟才出现吧。
盖新居、搬家：好吧。
旅行：安全吧。
结婚、交往：得到还可以的好结果吧。`;}
    else if (id == 66){
        qian = `第六十六凶
水滞少波涛
飞鸿落羽毛
重忧心绪乱
闲事惹风骚`
        jie = `
愿望：难实现。
疾病：可疑，不明朗吧。
遗失物：难出现吧。
盼望的人：不会出现吧。
盖新居、搬家：坏吧。
旅行：坏吧。
结婚、交往：坏吧。`;}
    else if (id == 67){
        qian = `第六十七凶
枯木未生枝
独步上云岐
岂知身未稳
独自惹闲非`
        jie = `
愿望：难实现吧。
疾病：会拖长吧。
遗失物：难出现吧。
盼望的人：不会出现吧。
盖新居、搬家：多比较看看比较好吧。
旅行：不好吧。
结婚、交往：坏吧。`;}
    else if (id == 68){
        qian = `第六十八吉
异梦生英杰
前来事可疑
芳菲春日暖
依旧发残枝`
        jie = `
愿望：会实现吧。
疾病：会治好吧。
遗失物：会出来吧。
盼望的人：会出现吧。
盖新居、搬家：好吧。
旅行：好吧。
结婚、交往：全都好吧。`;}
    else if (id == 69){
        qian = `第六十九凶
明月暗云浮
花红一半枯
惹事伤心处
行舟莫远图`
        jie = `
愿望：难实现吧。
疾病：切忌粗心大意。
遗失物：难出现吧。
盼望的人：不会出现吧。
盖新居、搬家：坏吧。
旅行：放弃吧。
结婚、交往：坏吧。`;}
    else if (id == 70){
        qian = `第七十凶
雷发庭前草
炎火向天飞
一心来赶禄
争奈掩朱扉
【争奈】就是宋代`
        jie = `以后的『怎奈』、『无奈』之意（更早的唐代则是『争那』）。

愿望：难实现吧。
疾病：不能安心吧。
遗失物：难出现吧。
盼望的人：不会出现吧。
盖新居、搬家：避免吧。
结婚、旅行、交往：万事坏吧。`;}
    else if (id == 71){
        qian = `第七十一凶
道业未成时
何期两不宜
事烦心绪乱
飜做徘徊思`
        jie = `
愿望：难实现吧。
疾病：会拖长吧。
遗失物：难出现吧。
盼望的人：不会出现吧。
盖新居、搬家：坏吧。
结婚、旅行、交往：产生坏的结果吧。`;}
    else if (id == 72){
        qian = `第七十二吉
户内防重厄
花菓见分枝
严霜纔过后
方可始相宜`
        jie = `
愿望：后来会实现吧。
疾病：会拖长吧。
遗失物：变成迟迟才能找到吧。
盼望的人：迟迟才出现吧。
盖新居、搬家：还算好吧。
旅行：没有特别的阻碍吧。
结婚、交往：虽然还算好，但最后变得更好吧。`;}
    else if (id == 73){
        qian = `第七十三吉
久暗渐分明
登江绿水澄
芝书从远降
终得异人成`
        jie = `
愿望：变得往后才能被实现吧。
疾病：会治好吧。
遗失物：会出来吧。
盼望的人：会出现吧。
盖新居、搬家：好吧。
旅行：好吧。
结婚、交往：全都好吧。`;}
    else if (id == 74){
        qian = `第七十四凶
蛇虎正交罗
牛生二尾多
交岁方成庆
上下不能和`
        jie = `
愿望：难以实现吧。
疾病：不能安心吧。
遗失物：难出现吧。
盼望的人：不会出现吧。
盖新居、搬家：坏吧。
结婚、旅行、交往：坏吧。`;}
    else if (id == 75){
        qian = `第七十五凶
孤舟欲过岸
浪急渡人空
女人立流水
望月意情浓`
        jie = `
愿望：难实现吧。
疾病：陷入的话（若是病人的话）危险吧。
遗失物：不能找回来吧。
盼望的人：不会出现吧。
盖新居、搬家：坏吧。
旅行：坏吧。
结婚、交往：坏吧。`;}
    else if (id == 76){
        qian = `第七十六吉
富贵天之佑
何须苦用心
前程应显迹
久用得高临`
        jie = `
愿望：会实现吧。
疾病：会治好吧。
遗失物：会出来吧。
盼望的人：会出现吧。
盖新居、搬家：好吧。
旅行：好吧。
结婚、交往：全部都好吧。`;}
    else if (id == 77){
        qian = `第七十七凶
累滞未能稣
求名莫远图
登舟波浪急
咫尺隔天衢`
        jie = `
愿望：难实现吧。
疾病：不能安心吧。
遗失物：难找到吧。
盼望的人：不会出现吧。
盖新居、搬家：坏吧。
旅行：坏吧。
结婚、交往：坏吧。`;}
    else if (id == 78){
        qian = `第七十八大吉
但存公道正
何愁理去忠
松柏苍苍翠
前山禄马重`
        jie = `
愿望：会实现吧。
疾病：会治好吧。
遗失物：会出来吧。
盼望的人：会出现吧。
盖新居、搬家：好吧。
旅行：好吧。
结婚、交往：全都好吧
    `;}
    else if (id == 79){
        qian = `第七十九吉
残月未还光
樽前非语伤
户中有人厄
祈福保青阳`
        jie = `
愿望：虽然能被实现但是大愿望不行吧。
疾病：虽然会拖长，但会治好吧。
遗失物：迟迟地才找到吧。
盼望的人：变迟才出现吧。
盖新居、搬家：好吧。
旅行：好吧。
结婚、交往：好吧。`;}
    else if (id == 80){
        qian = `第八十大吉
深山多养道
忠正帝王宣
凤遂鸾飞去
升高过九天`
        jie = `
愿望：会实现吧。
疾病：会治好吧。
遗失物：会出现吧。
盼望的人：会出现吧。
盖新居、搬家：好吧。
旅行：好吧。
结婚、交往：是好的，因为全部都保持谦虚的姿态，所以会招来好结果吧。`;}
    else if (id == 81){
        qian = `第八十一小吉
道合须成合
先忧事更多
所求财宝盛
更变得中和`
        jie = `
愿望：如果保持端正的心的话，会实现吧。
疾病：会治好吧。
遗失物：会出现吧。
盼望的人：会出现吧。
盖新居、搬家：好吧。
旅行：好吧。
结婚、交往：好吧。`;}
    else if (id == 82){
        qian = `第八十二凶
火发应连天
新愁惹旧愆
欲求千里外
要渡更无船`
        jie = `
愿望：难实现吧。
疾病：可疑，不明朗吧。
遗失物：难出现吧。
盼望的人：不会出现吧。
盖新居、搬家：坏吧。
旅行：多比较看看比较好吧。
结婚、交往：全都坏吧。`;}
    else if (id == 83){
        qian = `第八十三凶
举步出云端
高枝未可攀
升头看皎月
犹在黑云间`
        jie = `
愿望：难实现吧。
疾病：会拖长吧。
遗失物：难出现吧。
盼望的人：不会出现吧。
盖新居、搬家：坏吧。
旅行：危险吧。
结婚、交往：产生坏结果吧。`;}
    else if (id == 84){
        qian = `第八十四凶
否极方无泰
花开值晚秋
人情不调备
财宝鬼来偷`
        jie = `
愿望：难实现吧。
疾病：危险吧。
遗失物：难出现吧。
盼望的人：不会出现吧。
盖新居、搬家：坏吧。
旅行：不好吧。
结婚、交往：全部都产生坏的结果吧。`;}
    else if (id == 85){
        qian = `第八十五大吉
望用何愁晚
求名渐得宁
云梯终有望
归路入蓬瀛`
        jie = `
愿望：变成往后才会实现吧。
疾病：会治好吧。
遗失物：会出现吧。
盼望的人：会出现吧。
盖新居、搬家：好吧。
旅行：好吧。
结婚、交往：好吧。`;}
    else if (id == 86){
        qian = `第八十六大吉
花发应阳台
车行进宝财
执文朝帝殿
走马听声雷`
        jie = `
愿望：会实现吧。
疾病：会治好吧。
遗失物：会出现吧。
盼望的人：会出现吧。
盖新居、搬家：好吧。
旅行：好吧。
结婚、交往：全都好吧。`;}
    else if (id == 87){
        qian = `第八十七大吉
凿石方逢玉
淘沙始见金
青霄终有路
只恐不坚心`
        jie = `
愿望：能被实现吧。
疾病：会治好吧。
遗失物：会出现吧。
盼望的人：会出现吧。
盖新居、搬家：好吧。
结婚、交往：好吧。`;}
    else if (id == 88){
        qian = `第八十八凶
作事不和同
临危更主凶
佳人生苦根
闲虑两三重`
        jie = `
愿望：难实现吧。
疾病：危险吧。
遗失物：不会出现吧。
盼望的人：不会出现吧。
盖新居、搬家：坏吧。
旅行：坏吧。
结婚、交往：坏吧。`;}
    else if (id == 89){
        qian = `第八十九大吉
一片无瑕玉
从今好琢磨
得遇高人识
方逢喜气多`
        jie = `
愿望：能被实现吧。疾病：会治好吧。
遗失物：不会出现吧。
盼望的人：会出现吧。
盖新居、搬家：好吧。
旅行：好吧。
结婚、交往：好吧。`;}
    else if (id == 90){
        qian = `第九十大吉
一信向天飞
秦川舟自归
前途成好事
应得贵人推`
        jie = `
愿望：会实现吧。
疾病：会治好吧。
遗失物：会出现吧。
盼望的人：会出现吧。
盖新居、搬家：好吧。
旅行：好吧。
结婚、交往：全部都好吧。`;}
    else if (id == 91){
        qian = `第九十一吉
改变前途去
月桂又逢圆
云中乘禄至
凡事可宜先`
        jie = `
愿望：如果守正道的话会实现吧。
疾病：会治好吧。
遗失物：会出现吧。
盼望的人：会出现吧。
盖新居、搬家：好吧。
旅行：好吧。
结婚、交往：好吧。`;}
    else if (id == 92){
        qian = `第九十二吉
自幼常为旅
逢春骏马骄
前程宜进步
得箭降青霄`
        jie = `
愿望：会实现吧。
疾病：会治好吧。
遗失物：会出现吧。
盼望的人：会出现吧。
盖新居、搬家：好吧。
旅行：好吧。
结婚、交往：好吧。`;}
    else if (id == 93){
        qian = `第九十三吉
有鱼临旱池
跳跃入波涛
隔中须有望
先且虑尘劳`
        jie = `
愿望：变成到后来能实现吧。
疾病：会拖长吧。
遗失物：难出现吧。
盼望的人：变迟吧。
盖新居、搬家：马马虎虎还算可以吧。
旅行：好吧。
结婚、交往：好吧。`;}
    else if (id == 94){
        qian = `第九十四半吉
事忌樽前语
人防小辈交
幸乞阴公佑
方免事敌爻`
        jie = `
愿望：不能按照所想的实现吧。
疾病：虽然会拖长但是不会危害生命吧。要特别用心维持健康吧。
遗失物：会出现吧。
盼望的人：会出现吧。
盖新居、搬家：不好吧。
旅行：马马虎虎还算可以吧。
结婚、交往：勉强还算可以吧。`;}
    else if (id == 95){
        qian = `第九十五吉
志气勤修业
禄位未造逢
若闻金鸡语
乘船得便风`
        jie = `
愿望：能被实现吧。
疾病：变成迟迟才治好吧。
遗失物：变成迟迟地才出现吧。
盼望的人：迟迟地才出现吧。
盖新居、搬家：没有阻碍吧。
旅行：好吧。
结婚、交往：好吧。`;}
    else if (id == 96){
        qian = `第九十六大吉
鸡逐凤同飞
高林整羽仪
棹舟须济岸
宝货满船归`
        jie = `
愿望：能被实现吧。但是，抱持全面谨慎的心是很重要的。
疾病：会治好吧。
遗失物：会出现吧。
盼望的人：会出现吧。
盖新居、搬家：好吧。
旅行：好吧。
结婚、交往：全部好吧。`;}
    else if (id == 97){
        qian = `第九十七凶
雾罩重楼屋
佳人水上行
白云归去路
不见月波澄`
        jie = `
愿望：难以实现吧。
疾病：危险吧。
遗失物：难出现吧。
盼望的人：不会出现吧。
盖新居、搬家：坏吧。
旅行：不好吧。
结婚、交往：坏吧。`;}
    else if (id == 98){
        qian = `第九十八凶
欲理新丝乱
闲愁足是非
只困罗网里
相见几人悲`
        jie = `
愿望：难以实现吧。
疾病：可疑，不明朗吧。
遗失物：难出现吧。
盼望的人：不会出现吧。
盖新居、搬家：坏吧。
旅行：坏吧。
结婚、交往：坏吧。`;}
    else if (id == 99){
        qian = `第九十九大吉
红日当门照
暗月再重圆
遇珍须得宝
颇有称心田`
        jie = `
愿望：能被实现吧。在万事中要用谦虚的心吧。
疾病：会治好吧。
遗失物：会出现吧。
盼望的人：会出现吧。
盖新居、搬家：好吧。
旅行：好吧。
结婚、交往：好吧。`;}
    else if (id == 100){
        qian = `第一百签凶
禄走白云间
携琴走远山
不遇神仙面
空惹意阑珊`
        jie = `
愿望：难实现吧。
疾病：危险吧。
遗失物：难出现吧。
盼望的人：坏吧。
盖新居、搬家：坏吧。
旅行：坏吧。
结婚、交往：全部坏吧。`;}
    return [qian, jie];
}

module.exports = {
  ChouQian: ChouQian,
}
